{
  "techContent": [
    {
      "image": "assets/student_home/book_shelf.png",
      "title": "Master Skills Through Engaging Quizzes",
      "description": "Unlock your potential with interactive quizzes designed for rapid learning and comprehensive understanding. Practice, reinforce your knowledge, and become a proficient professional faster."
    },
    {
      "image": "assets/student_home/it.jpg",
      "title": "Learn Faster, Understand Deeper with Quiz-Based Learning",
      "description": "Skill Factorial empowers you to grasp complex topics quickly through focused quizzes. Maximize your learning efficiency and gain a holistic understanding of subjects in less time. Start practicing and accelerate your skill development journey today!"
    }
  ],
  "techContentRow": [
    {
      "image": "assets/student_home/student_lib.png",
      "title": "Smart Quiz Technology",
      "description": "Experience intelligent quizzes that adapt to your learning pace and identify areas for improvement, ensuring efficient and personalized skill development."
    },
    {
      "image": "assets/student_home/student_system_f.png",
      "title": "Practice Makes Perfect: Your Path to Mastery",
      "description": "Dive into a world of targeted practice quizzes designed to transform you from a beginner to an expert. Consistent practice on Skill Factorial is your key to career success."
    },
    {
      "image": "assets/student_home/student_ask.png",
      "title": "Interactive Learning & Instant Feedback",
      "description": "Engage with dynamic quizzes and receive immediate feedback to reinforce your understanding and accelerate your learning journey."
    },
    {
      "image": "assets/student_home/student_class.png",
      "title": "Unlock Your Potential with Skill Factorial's Quizzes",
      "description": "Based in Hyderabad, Skill Factorial is dedicated to empowering you with practical skills through innovative quiz-based learning. Bridge the gap between theory and application and achieve your career goals efficiently. Join us and grow!"
    }
  ],
  "internshipTexts": [
    "Skill Factorial.com is your gateway to mastering technology. We're passionate about empowering students like YOU with the skills and practical experience needed to excel in your studies.",
    "Struggling to grasp concepts? Practice makes perfect! Quizzes, assignments, and projects are your keys to deeper understanding and confidence.",
    "The academic world can be challenging, but with structured practice through assignments and projects, you're building a solid foundation for success.",
    "Break away from traditional rote learning. Engage with flexible and interactive quizzes, assignments, and projects designed to fit your schedule.",
    "Ready to excel in your subjects? Practical learning through quizzes, assignments, and projects bridges the gap between theory and application, boosting your knowledge and skills."
  ],
  "featureData": [
    {
      "icon": "person",
      "title": "Personalized Quiz Experience",
      "description": "Quizzes tailored to your learning goals and progress, ensuring you focus on what matters most for your skill development."
    },
    {
      "icon": "lightbulb_outline",
      "title": "Learn from Expert Insights (via Quiz Design)",
      "description": "Gain valuable insights and practical knowledge embedded within expertly crafted quiz questions and explanations."
    },
    {
      "icon": "menu_book",
      "title": "Concise Learning Through Quizzes",
      "description": "Efficiently grasp core concepts across various topics through well-structured and focused quiz formats."
    },
    {
      "icon": "doubts",
      "title": "Weekly Quiz Doubt Clarification",
      "description": "Get your questions answered in our weekly sessions dedicated to resolving any doubts you encounter while practicing the quizzes."
    },
    {
      "icon": "person",
      "title": "Quiz Anytime, Anywhere",
      "description": "Access our quizzes at your convenience and learn according to your own schedule."
    },
    {
      "icon": "book",
      "title": "Explore Diverse Quiz Topics",
      "description": "Choose from a wide range of subjects and expand your knowledge through engaging quizzes."
    },
    {
      "icon": "chartLine",
      "title": "Immediate Quiz Results & Insights",
      "description": "Receive instant scores and detailed explanations after each quiz to track your progress and understand concepts quickly."
    }
  ],
  "contactData": [
    { "icon": "email", "title": "Email", "text": "support@skillfactorial.com" },
    { "icon": "phone", "title": "Phone", "text": "+91 8175989767" },
    {
      "icon": "message_rounded",
      "title": "Whatsapp",
      "text": "+91 8175989767"
    },
    {
      "icon": "location_on",
      "title": "Location",
      "text": "Skill Factorial, Near to Archid Tower, Baner, Pune-422045"
    }
  ]
}
